fio/results/Amazon Web Services/c5d/randwrite.out
job0: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
fio-2.14
Starting 4 processes
{
  "fio version" : "fio-2.14",
  "timestamp" : 1583515397,
  "timestamp_ms" : 1583515397467,
  "time" : "Fri Mar  6 17:23:17 2020",
  "global options" : {
    "size" : "100g",
    "rw" : "randwrite",
    "ioengine" : "libaio",
    "bs" : "4k",
    "nrfiles" : "1",
    "direct" : "1",
    "sync" : "0",
    "end_fsync" : "1",
    "iodepth" : "128",
    "invalidate" : "1",
    "verify" : "0"
  },
  "jobs" : [
    {
      "jobname" : "job0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 157,
      "job options" : {
        "filename" : "/dev/nvme1n1"
      },
      "read" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 104857600,
        "bw" : 670509,
        "iops" : 167627.328125,
        "runtime" : 156385,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 2601,
          "mean" : 4.056255,
          "stddev" : 13.634713
        },
        "clat" : {
          "min" : 16,
          "max" : 5874,
          "mean" : 758.417358,
          "stddev" : 215.996429,
          "percentile" : {
            "1.000000" : 169,
            "5.000000" : 494,
            "10.000000" : 588,
            "20.000000" : 708,
            "30.000000" : 724,
            "40.000000" : 740,
            "50.000000" : 748,
            "60.000000" : 756,
            "70.000000" : 764,
            "80.000000" : 772,
            "90.000000" : 796,
            "95.000000" : 1192,
            "99.000000" : 1704,
            "99.500000" : 1816,
            "99.900000" : 2128,
            "99.950000" : 2288,
            "99.990000" : 2704,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 21,
          "max" : 5894,
          "mean" : 762.473633,
          "stddev" : 216.629242
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 35.053459,
      "sys_cpu" : 35.389172,
      "ctx" : 962271,
      "majf" : 0,
      "minf" : 12,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.010000,
        "50" : 0.185356,
        "100" : 0.433289,
        "250" : 0.688053,
        "500" : 3.952194,
        "750" : 51.609501,
        "1000" : 36.413860
      },
      "latency_ms" : {
        "2" : 6.527138,
        "4" : 0.190266,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job1",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 157,
      "job options" : {
        "filename" : "/dev/nvme2n1"
      },
      "read" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 104857600,
        "bw" : 671776,
        "iops" : 167944.140625,
        "runtime" : 156090,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 2394,
          "mean" : 4.136709,
          "stddev" : 16.395174
        },
        "clat" : {
          "min" : 15,
          "max" : 3822,
          "mean" : 756.951172,
          "stddev" : 242.968079,
          "percentile" : {
            "1.000000" : 161,
            "5.000000" : 450,
            "10.000000" : 532,
            "20.000000" : 708,
            "30.000000" : 724,
            "40.000000" : 732,
            "50.000000" : 740,
            "60.000000" : 748,
            "70.000000" : 764,
            "80.000000" : 772,
            "90.000000" : 796,
            "95.000000" : 1256,
            "99.000000" : 1784,
            "99.500000" : 1928,
            "99.900000" : 2224,
            "99.950000" : 2352,
            "99.990000" : 2672,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 21,
          "max" : 3823,
          "mean" : 761.087891,
          "stddev" : 243.704483
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 34.277882,
      "sys_cpu" : 32.774250,
      "ctx" : 1031411,
      "majf" : 0,
      "minf" : 9,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.010000,
        "50" : 0.190762,
        "100" : 0.458004,
        "250" : 0.715107,
        "500" : 6.813313,
        "750" : 49.528984,
        "1000" : 34.919449
      },
      "latency_ms" : {
        "2" : 7.028980,
        "4" : 0.345394,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job2",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 157,
      "job options" : {
        "filename" : "/dev/nvme3n1"
      },
      "read" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 104857600,
        "bw" : 672823,
        "iops" : 168206.000000,
        "runtime" : 155847,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 2480,
          "mean" : 4.094165,
          "stddev" : 12.796088
        },
        "clat" : {
          "min" : 18,
          "max" : 4379,
          "mean" : 755.778198,
          "stddev" : 210.323441,
          "percentile" : {
            "1.000000" : 117,
            "5.000000" : 486,
            "10.000000" : 580,
            "20.000000" : 716,
            "30.000000" : 732,
            "40.000000" : 740,
            "50.000000" : 748,
            "60.000000" : 756,
            "70.000000" : 764,
            "80.000000" : 772,
            "90.000000" : 804,
            "95.000000" : 1144,
            "99.000000" : 1656,
            "99.500000" : 1768,
            "99.900000" : 2096,
            "99.950000" : 2256,
            "99.990000" : 2672,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 21,
          "max" : 4380,
          "mean" : 759.872375,
          "stddev" : 210.899750
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 34.436558,
      "sys_cpu" : 33.268097,
      "ctx" : 1080867,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.010000,
        "50" : 0.260948,
        "100" : 0.598587,
        "250" : 0.745468,
        "500" : 4.267921,
        "750" : 49.545116,
        "1000" : 37.777058
      },
      "latency_ms" : {
        "2" : 6.652908,
        "4" : 0.151436,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job3",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 157,
      "job options" : {
        "filename" : "/dev/nvme4n1"
      },
      "read" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 104857600,
        "bw" : 676828,
        "iops" : 169207.031250,
        "runtime" : 154925,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 2210,
          "mean" : 4.174550,
          "stddev" : 13.453361
        },
        "clat" : {
          "min" : 19,
          "max" : 3708,
          "mean" : 751.269470,
          "stddev" : 220.191971,
          "percentile" : {
            "1.000000" : 112,
            "5.000000" : 466,
            "10.000000" : 556,
            "20.000000" : 708,
            "30.000000" : 724,
            "40.000000" : 740,
            "50.000000" : 748,
            "60.000000" : 756,
            "70.000000" : 764,
            "80.000000" : 772,
            "90.000000" : 796,
            "95.000000" : 1160,
            "99.000000" : 1672,
            "99.500000" : 1784,
            "99.900000" : 2160,
            "99.950000" : 2320,
            "99.990000" : 2672,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 22,
          "max" : 3715,
          "mean" : 755.444031,
          "stddev" : 220.823853
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 32.162220,
      "sys_cpu" : 33.744289,
      "ctx" : 1114094,
      "majf" : 0,
      "minf" : 11,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.010000,
        "50" : 0.238216,
        "100" : 0.650215,
        "250" : 0.908127,
        "500" : 5.238018,
        "750" : 49.904362,
        "1000" : 36.223907
      },
      "latency_ms" : {
        "2" : 6.634197,
        "4" : 0.202953,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme1n1",
      "read_ios" : 84,
      "write_ios" : 26214400,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 8,
      "write_ticks" : 17003827,
      "in_queue" : 280,
      "util" : 99.917572
    },
    {
      "name" : "nvme2n1",
      "read_ios" : 84,
      "write_ios" : 26214400,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 8,
      "write_ticks" : 17051876,
      "in_queue" : 0,
      "util" : 99.760361
    },
    {
      "name" : "nvme3n1",
      "read_ios" : 84,
      "write_ios" : 26214400,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 8,
      "write_ticks" : 17384046,
      "in_queue" : 0,
      "util" : 99.610191
    },
    {
      "name" : "nvme4n1",
      "read_ios" : 84,
      "write_ios" : 26214400,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 12,
      "write_ticks" : 17416549,
      "in_queue" : 0,
      "util" : 99.011368
    }
  ]
}

job0: (groupid=0, jobs=1): err= 0: pid=38577: Fri Mar  6 17:23:17 2020
  write: io=102400MB, bw=670509KB/s, iops=167627, runt=156385msec
    slat (usec): min=1, max=2601, avg= 4.06, stdev=13.63
    clat (usec): min=16, max=5874, avg=758.42, stdev=216.00
     lat (usec): min=21, max=5894, avg=762.47, stdev=216.63
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  494], 10.00th=[  588], 20.00th=[  708],
     | 30.00th=[  724], 40.00th=[  740], 50.00th=[  748], 60.00th=[  756],
     | 70.00th=[  764], 80.00th=[  772], 90.00th=[  796], 95.00th=[ 1192],
     | 99.00th=[ 1704], 99.50th=[ 1816], 99.90th=[ 2128], 99.95th=[ 2288],
     | 99.99th=[ 2704]
    lat (usec) : 20=0.01%, 50=0.19%, 100=0.43%, 250=0.69%, 500=3.95%
    lat (usec) : 750=51.61%, 1000=36.41%
    lat (msec) : 2=6.53%, 4=0.19%, 10=0.01%
  cpu          : usr=35.05%, sys=35.39%, ctx=962271, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=26214400/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job1: (groupid=0, jobs=1): err= 0: pid=38578: Fri Mar  6 17:23:17 2020
  write: io=102400MB, bw=671777KB/s, iops=167944, runt=156090msec
    slat (usec): min=1, max=2394, avg= 4.14, stdev=16.40
    clat (usec): min=15, max=3822, avg=756.95, stdev=242.97
     lat (usec): min=21, max=3823, avg=761.09, stdev=243.70
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  450], 10.00th=[  532], 20.00th=[  708],
     | 30.00th=[  724], 40.00th=[  732], 50.00th=[  740], 60.00th=[  748],
     | 70.00th=[  764], 80.00th=[  772], 90.00th=[  796], 95.00th=[ 1256],
     | 99.00th=[ 1784], 99.50th=[ 1928], 99.90th=[ 2224], 99.95th=[ 2352],
     | 99.99th=[ 2672]
    lat (usec) : 20=0.01%, 50=0.19%, 100=0.46%, 250=0.72%, 500=6.81%
    lat (usec) : 750=49.53%, 1000=34.92%
    lat (msec) : 2=7.03%, 4=0.35%
  cpu          : usr=34.28%, sys=32.77%, ctx=1031411, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=26214400/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job2: (groupid=0, jobs=1): err= 0: pid=38579: Fri Mar  6 17:23:17 2020
  write: io=102400MB, bw=672824KB/s, iops=168205, runt=155847msec
    slat (usec): min=1, max=2480, avg= 4.09, stdev=12.80
    clat (usec): min=18, max=4379, avg=755.78, stdev=210.32
     lat (usec): min=21, max=4380, avg=759.87, stdev=210.90
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  486], 10.00th=[  580], 20.00th=[  716],
     | 30.00th=[  732], 40.00th=[  740], 50.00th=[  748], 60.00th=[  756],
     | 70.00th=[  764], 80.00th=[  772], 90.00th=[  804], 95.00th=[ 1144],
     | 99.00th=[ 1656], 99.50th=[ 1768], 99.90th=[ 2096], 99.95th=[ 2256],
     | 99.99th=[ 2672]
    lat (usec) : 20=0.01%, 50=0.26%, 100=0.60%, 250=0.75%, 500=4.27%
    lat (usec) : 750=49.55%, 1000=37.78%
    lat (msec) : 2=6.65%, 4=0.15%, 10=0.01%
  cpu          : usr=34.44%, sys=33.27%, ctx=1080867, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=26214400/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job3: (groupid=0, jobs=1): err= 0: pid=38580: Fri Mar  6 17:23:17 2020
  write: io=102400MB, bw=676828KB/s, iops=169207, runt=154925msec
    slat (usec): min=1, max=2210, avg= 4.17, stdev=13.45
    clat (usec): min=19, max=3708, avg=751.27, stdev=220.19
     lat (usec): min=22, max=3715, avg=755.44, stdev=220.82
    clat percentiles (usec):
     |  1.00th=[  112],  5.00th=[  466], 10.00th=[  556], 20.00th=[  708],
     | 30.00th=[  724], 40.00th=[  740], 50.00th=[  748], 60.00th=[  756],
     | 70.00th=[  764], 80.00th=[  772], 90.00th=[  796], 95.00th=[ 1160],
     | 99.00th=[ 1672], 99.50th=[ 1784], 99.90th=[ 2160], 99.95th=[ 2320],
     | 99.99th=[ 2672]
    lat (usec) : 20=0.01%, 50=0.24%, 100=0.65%, 250=0.91%, 500=5.24%
    lat (usec) : 750=49.90%, 1000=36.22%
    lat (msec) : 2=6.63%, 4=0.20%
  cpu          : usr=32.16%, sys=33.74%, ctx=1114094, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=26214400/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=409600MB, aggrb=2619.2MB/s, minb=670509KB/s, maxb=676828KB/s, mint=154925msec, maxt=156385msec

Disk stats (read/write):
  nvme1n1: ios=84/26214400, merge=0/0, ticks=8/17003827, in_queue=280, util=99.92%
  nvme2n1: ios=84/26214400, merge=0/0, ticks=8/17051876, in_queue=0, util=99.76%
  nvme3n1: ios=84/26214400, merge=0/0, ticks=8/17384046, in_queue=0, util=99.61%
  nvme4n1: ios=84/26214400, merge=0/0, ticks=12/17416549, in_queue=0, util=99.01%